app/controllers/posts_controller.rb

  def index
    @posts = Post.order(:created_at).page(params[:page])
---
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM `posts` LIMIT 25 OFFSET 0) subquery_for_count
SELECT `posts`.* FROM `posts` ORDER BY created_at LIMIT 25 OFFSET 0

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`body`, `created_at`, `email`, `name`, `title`, `updated_at`) VALUES ('A empresa ACME, de Santa Catarina, está com projeto na Bahia e precisa de advogado com especialização em direito ambiental...', '2013-10-16 05:09:35', 'william@criatio.com', 'William dos Santos de Oliveira', 'Consultor(a) Direito Ambiental', '2013-10-16 05:09:35')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "posts" SET "title" = 'Consultor Desenvolvimento Humano Organizacional', "updated_at" = '2013-10-14 16:28:15.310350' WHERE "posts"."id" = 3